RT-Thread/rt-thread/bsp/nxp/lpc/lpc55sxx/Libraries/LPC55S16/LPC55S16/drivers/fsl_power.c
    /* Only FRO32K, XTAL32K, COMP, BIAS and LDO_MEM can be stay powered during POWERDOWN (valid from application point
     * of view; Hardware allows BODVBAT, LDODEEPSLEEP and FRO1M to stay powered, that's why they are excluded below) */
    lv_low_power_mode_cfg.PDCTRL0 = (~exclude_from_pd) | (uint32_t)kPDRUNCFG_PD_BODVBAT | (uint32_t)kPDRUNCFG_PD_FRO1M |
                                    (uint32_t)kPDRUNCFG_PD_LDODEEPSLEEP;

    /* @TODO Guillaume: add save/restore entropy during PowerDown */
    /* Entropy for RNG need to saved */
    if ((exclude_from_pd & (uint32_t)kPDRUNCFG_PD_RNG) != 0UL)
    {
        CLOCK_EnableClock(kCLOCK_Rng);
        RESET_ClearPeripheralReset(kRNG_RST_SHIFT_RSTn);
        for (int i = 0; i < 6; i++)
        {
            rng_entropy_save[i] = RNG->RANDOM_NUMBER;
        }
    }

    /* CPU0 retention Ctrl.
     * For the time being, we do not allow customer to relocate the CPU retention area in SRAMX, meaning that the
     * retention area range is [0x0400_6000 - 0x0400_6600] (beginning of RAMX2 for N4S) If required by customer,
     * retention area range is [0x0400_2000 - 0x0400_2600] (beginning of RAMX2 for N4M) If required by customer,
     * cpu_retention_ctrl[13:1] will be used for that to modify the default retention area
     */
    lv_low_power_mode_cfg.CPURETCTRL =
        (cpu_retention_ctrl & LOWPOWER_CPURETCTRL_ENA_MASK) |
        ((((uint32_t)CPU_RETENTION_RAMX_STORAGE_START_ADDR >> 2UL) << LOWPOWER_CPURETCTRL_MEMBASE_INDEX) &
         LOWPOWER_CPURETCTRL_MEMBASE_MASK);
    if (0UL != (cpu_retention_ctrl & 0x1UL))
    {
        /* Add RAMX2 for retention */
        sram_retention_ctrl |= LOWPOWER_SRAMRETCTRL_RETEN_RAMX2;
        /* CPU retention is required: store Analog Controller Registers */
        analog_ctrl_regs[0]  = ANACTRL->FRO192M_CTRL;
        analog_ctrl_regs[1]  = ANACTRL->ANALOG_CTRL_CFG;
        analog_ctrl_regs[2]  = ANACTRL->ADC_CTRL;
        analog_ctrl_regs[3]  = ANACTRL->XO32M_CTRL;
        analog_ctrl_regs[4]  = ANACTRL->BOD_DCDC_INT_CTRL;
        analog_ctrl_regs[5]  = ANACTRL->RINGO0_CTRL;
        analog_ctrl_regs[6]  = ANACTRL->RINGO1_CTRL;
        analog_ctrl_regs[7]  = ANACTRL->RINGO2_CTRL;
        analog_ctrl_regs[8]  = ANACTRL->LDO_XO32M;
        analog_ctrl_regs[9]  = ANACTRL->AUX_BIAS;
        analog_ctrl_regs[10] = ANACTRL->USBHS_PHY_CTRL;
        analog_ctrl_regs[11] = ANACTRL->USBHS_PHY_TRIM;
    }

    /* SRAM retention control during POWERDOWN */
    lv_low_power_mode_cfg.SRAMRETCTRL = sram_retention_ctrl;

    /* Sanity check: If retention is required for any of SRAM instances, make sure LDO MEM will stay powered */
    if ((sram_retention_ctrl & 0x7FFFUL) != 0UL)
    {
        lv_low_power_mode_cfg.PDCTRL0 &= ~(uint32_t)kPDRUNCFG_PD_LDOMEM;
    }

    /* Voltage control in Low Power Modes */
    /* The Memories Voltage settings below are for voltage scaling */
    lv_low_power_mode_cfg.VOLTAGE = lf_set_ldo_ao_ldo_mem_voltage(LOWPOWER_CFG_LPMODE_POWERDOWN, 0);

    /* CPU Wake up & Interrupt sources control : only WAKEUP_GPIO_GLOBALINT0, WAKEUP_GPIO_GLOBALINT1, WAKEUP_FLEXCOMM3,
     * WAKEUP_ACMP_CAPT, WAKEUP_RTC_LITE_ALARM_WAKEUP, WAKEUP_OS_EVENT_TIMER, WAKEUP_ALLWAKEUPIOS */
    wakeup_src_int = (uint64_t)(WAKEUP_GPIO_GLOBALINT0 | WAKEUP_GPIO_GLOBALINT1 | WAKEUP_FLEXCOMM3 | WAKEUP_ACMP |
                                WAKEUP_RTC_LITE_ALARM_WAKEUP | WAKEUP_OS_EVENT_TIMER | WAKEUP_ALLWAKEUPIOS);
    lv_low_power_mode_cfg.WAKEUPINT = wakeup_interrupts & wakeup_src_int;
    lv_low_power_mode_cfg.WAKEUPSRC = wakeup_interrupts & wakeup_src_int;

    cpu0_nmi_enable = SYSCON->NMISRC & SYSCON_NMISRC_NMIENCPU0_MASK; /* Save the configuration of the NMI Register */
    SYSCON->NMISRC &= ~SYSCON_NMISRC_NMIENCPU0_MASK;                 /* Disable NMI of CPU0 */

    /* Save the configuration of the CPU interrupt enable Registers (because they are overwritten inside the low power
     * API */
    cpu0_int_enable_0 = NVIC->ISER[0];
    cpu0_int_enable_1 = NVIC->ISER[1];

    /* Disable BoD VBAT and BoD Core resets */
    /* BOD VBAT disable reset */
    pmc_reset_ctrl =
        PMC->RESETCTRL & (~(PMC_RESETCTRL_BODVBATRESETENA_SECURE_MASK | PMC_RESETCTRL_BODVBATRESETENA_SECURE_DP_MASK));
    pmc_reset_ctrl |= (0x2UL << PMC_RESETCTRL_BODVBATRESETENA_SECURE_SHIFT) |
                      (0x2UL << PMC_RESETCTRL_BODVBATRESETENA_SECURE_DP_SHIFT);

    /* BOD CORE disable reset */
    pmc_reset_ctrl &= (~(PMC_RESETCTRL_BODCORERESETENA_SECURE_MASK | PMC_RESETCTRL_BODCORERESETENA_SECURE_DP_MASK));
    pmc_reset_ctrl |= (0x2UL << PMC_RESETCTRL_BODCORERESETENA_SECURE_SHIFT) |
                      (0x2UL << PMC_RESETCTRL_BODCORERESETENA_SECURE_DP_SHIFT);

    PMC->RESETCTRL = pmc_reset_ctrl;

    /* Enter low power mode */
    POWER_EnterLowPower(&lv_low_power_mode_cfg);

    /*** We'll reach this point in case of POWERDOWN with CPU retention or if the POWERDOWN has not been taken (for
      instance because an interrupt is pending). In case of CPU retention, assumption is that the SRAM containing the
      stack used to call this function shall be preserved during low power ***/

#if defined(PUF_SRAM_CTRL_CFG_ENABLE_MASK)
    /* Following code is to reset PUF to remove over consumption */
    /* Enable PUF register clock to access register */
    SYSCON->AHBCLKCTRLSET[2] = SYSCON_AHBCLKCTRL2_PUF_MASK;
    /* Release PUF reset */
    SYSCON->PRESETCTRLCLR[2] = SYSCON_PRESETCTRL2_PUF_RST_MASK;
    /* Enable PUF SRAM */
    PUF_SRAM_CTRL->CFG |= PUF_SRAM_CTRL_CFG_ENABLE_MASK | PUF_SRAM_CTRL_CFG_CKGATING_MASK;

    /* Disable PUF register clock. */
    // Delaying the line of code below until the PUF State Machine execution is completed:
    // Shuting down the clock to early will prevent the state machine from reaching the end.
    // => Wait for status bit in PUF Controller Registers before stop PUF clock.
    while (0UL == (PUF_SRAM_CTRL->INT_STATUS & PUF_SRAM_CTRL_INT_STATUS_READY_MASK))
    {
    }

    SYSCON->AHBCLKCTRLCLR[2] = SYSCON_AHBCLKCTRL2_PUF_MASK;
#endif
    /* Restore the configuration of the NMI Register */
    SYSCON->NMISRC |= cpu0_nmi_enable;

    /* Restore PMC RESETCTRL register */
    PMC->RESETCTRL = pmc_reset_ctrl;

